---
kind: method
id: M:Autodesk.Revit.UI.EditorInteraction.#ctor(Autodesk.Revit.UI.EditorInteractionType)
source: html/dcba1b93-c4f8-b1d4-5f63-7af6acb1870b.htm
---
# Autodesk.Revit.UI.EditorInteraction.#ctor Method

Construct the interaction with the specified type.

## Syntax (C#)
```csharp
public EditorInteraction(
	EditorInteractionType interactionType
)
```

## Parameters
- **interactionType** (`Autodesk.Revit.UI.EditorInteractionType`)